<?php

namespace Database\Seeders;

use App\Models\Cabinet;
use Illuminate\Database\Seeder;

class CabinetSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {

        $cabinets = [
            [
                'name' => 'الخزانة العامة',
            ],
            [
                'name' => 'خزانة الشيخ حمو باباوموسى',
            ],
            [
                'name' => 'خزانة الشيخ صالح بن كاسي',
            ],
            [
                'name' => 'خزانة الحاج بكير بوكرموش',
            ],
            [
                'name' => 'خزانة باحمد اشقبقب',
            ],
            [
                'name' => 'مكتبة الأستاذ محمد بن أيوب الحاج سعيد (لخبورات)',
            ],
            [
                'name' => 'خزانة دار التعليم (للمشائخ الثلاثة: مامة بنت سليمان بباز، بكير بن عمر موسى وعلي، بكير بن علي موسى وعلي)',
            ],
            [
                'name' => 'خزانة الشيخ القاضي أبي بكر بن مسعود الغرداوي الشهير بالشيخ الحاج ببكر',
            ],
            [
                'name' => 'خزانة دار التلاميذ (إروان) بجامع غرداية الكبير',
            ],
            [
                'name' => 'الخزائن العمانية',
            ],
            [
                'name' => 'خزانة الشيخ بنوح بن أحمد مصباح',
            ],
            [
                'name' => 'خزانة الشيخ صالح بن حمو بابهون',
            ],
            [
                'name' => 'خزانة الشيخ باسة بن أمي موسى الوارجلاني',
            ],
            [
                'name' => 'خزانة آل اشقبقب (للناسخ المحترف ابراهيم بن سليمان اشقبقب ونجله صالح)',
            ],
            [
                'name' => 'خزانة الشيخ بنوح مصباح',
            ],
            [
                'name' => 'خزانة الشيخ صالح بابهون',
            ],
            [
                'name' => 'مكتبة معهد الإصلاح بغرداية',
            ],
            [
                'name' => 'خزانة الشيخ محمد بن سليمان بن ادريسو اليسجني ونجليه صالح وسليمان',
            ],
            [
                'name' => 'مكتبة الأستاذ سليمان بن محمد بومعقل (وارجلان)',
            ],
            [
                'name' => 'خزانة البكري للشيخ العلامة عبد الرحمن بن عمر بكلي',
            ],
            [
                'name' => 'خزانة الشيخ باحمد بن صالح كيوكيو',
            ],
            [
                'name' => 'خزانة الشيخ الحاج حمو بن ابراهيم تامتلت',
            ],
            [
                'name' => 'خزانة جمعية الشيخ أبي إسحاق اطفيش لخدمة التراث',
            ],
            [
                'name' => 'خزانة دار العلم للشيخ الحاج عمر بن الحاج مسعود القراري',
            ]
        ];

        foreach($cabinets as $cabinet){
            Cabinet::create($cabinet);
        }
    }
}
